renesas/rx-driver-package/source/r_lpc_rx/r_lpc_rx_vx.xx/r_lpc_rx/src/targets/rx23e-b/r_lpc_rx23e-b.c
    switch (e_mode)
    {
        case LPC_OP_HIGH_SPEED:

            /* Check if clock speeds are within limits */
            if ((((((iclk_freq > LPC_MAX_ICK_HIGH_SPEED_FREQ_HZ)
                || (fclk_freq > LPC_MAX_FCK_HIGH_SPEED_FREQ_HZ))
                || (pclka_freq > LPC_MAX_PCKA_HIGH_SPEED_FREQ_HZ))
                || (pclkb_freq > LPC_MAX_PCKB_HIGH_SPEED_FREQ_HZ))
                || (pclkc_freq > LPC_MAX_PCKC_HIGH_SPEED_FREQ_HZ))
                || (pclkd_freq > LPC_MAX_PCKD_HIGH_SPEED_FREQ_HZ))
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
            break;
        case LPC_OP_MIDDLE_SPEED:

            /* Check if clock speeds are within limits */
            if ((((((iclk_freq > LPC_MAX_ICK_MID_SPEED_FREQ_HZ)
                || (fclk_freq > LPC_MAX_FCK_MID_SPEED_FREQ_HZ))
                || (pclka_freq > LPC_MAX_PCKA_MID_SPEED_FREQ_HZ))
                || (pclkb_freq > LPC_MAX_PCKB_MID_SPEED_FREQ_HZ))
                || (pclkc_freq > LPC_MAX_PCKC_MID_SPEED_FREQ_HZ))
                || (pclkd_freq > LPC_MAX_PCKD_MID_SPEED_FREQ_HZ))
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
            break;
        case LPC_OP_LOW_SPEED:

            /* Check if clock speeds are within limits */
            if ((((((iclk_freq > LPC_MAX_ICK_LOW_SPEED_FREQ_HZ)
                || (fclk_freq > LPC_MAX_FCK_LOW_SPEED_FREQ_HZ))
                || (pclka_freq > LPC_MAX_PCKA_LOW_SPEED_FREQ_HZ))
                || (pclkb_freq > LPC_MAX_PCKB_LOW_SPEED_FREQ_HZ))
                || (pclkc_freq > LPC_MAX_PCKC_LOW_SPEED_FREQ_HZ))
                || (pclkd_freq > LPC_MAX_PCKD_LOW_SPEED_FREQ_HZ))
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
            if (((((LPC_CLOCK_ACTIVE == SYSTEM.LOCOCR.BYTE)     /* Check if LOCO is running */
                || (LPC_CLOCK_ACTIVE == SYSTEM.HOCOCR.BYTE))    /* Check if HOCO is running */
                || (LPC_CLOCK_ACTIVE == SYSTEM.MOSCCR.BYTE))    /* Check if Main Osc is running */
                || (LPC_CLOCK_ACTIVE == SYSTEM.PLLCR2.BYTE)))    /* Check if PLL is running */

                /* Check if UPLL is running */
            {
                return LPC_ERR_CLOCK_EXCEEDED;
            }
            break;
        default:

            /* nothing here */
            break;
    }
    return LPC_SUCCESS;
}
/*********************************************************************************************************************
 End of function lpc_freq_range_check
 ********************************************************************************************************************/

/*********************************************************************************************************************
 * Function Name: lpc_clockhzget
 * Description  : This function will return the requested internal clock frequency in Hz
 * Arguments    : lpc_system_clocks_t clock -
 *                    Specifies the internal clock whose frequency will be returned in Hz .
 *
 * Return Value : uint32_t frequency - clock  frequency in hz
 ********************************************************************************************************************/
static uint32_t lpc_clockhzget (lpc_system_clocks_t clock)
{
    uint32_t divisor;
    uint32_t pll_clk_src_freq;
    float    pll_multiplier;

    /* Determine the current HOCO frequency */
    clock_frequency[LPC_CKSEL_HOCO] = 0;
    if (LPC_CLOCK_ACTIVE == SYSTEM.HOCOCR.BIT.HCSTP)
    {
        /* Get the currently programmed HOCO frequency and update the clock_frequency[]
         * array in case it has changed. */
        clock_frequency[LPC_CKSEL_HOCO] = hoco_frequency[SYSTEM.HOCOCR.BIT.HCSTP];
    }

    /* Determine the current PLL frequency */
    clock_frequency[LPC_CKSEL_PLL] = 0;
    if (LPC_CLOCK_ACTIVE == SYSTEM.PLLCR2.BIT.PLLEN)
    {
        /*
         * Calculate the PLL clock frequency as follows:
         * - Determine the main oscillator's frequency
         * - Determine the programmed PLL input divider value from PLLCR.PLIDIV
         * - Determine the programmed PLL output multiplier from PLLCR.STC
         * - Calculate the PLL clock frequency as ((SRC_CLK_FREQ / PLL_DIV) * PLL_MUL)
         */
        pll_clk_src_freq = clock_frequency[LPC_CKSEL_MAIN_OSC];
        pll_multiplier   = (((float) SYSTEM.PLLCR.BIT.STC + 1.0f) / 2.0f);

        /* Finally, calculate the PLL clock frequency */
        clock_frequency[LPC_CKSEL_PLL] = (uint32_t) (((float) pll_clk_src_freq / (float) (1 << SYSTEM.PLLCR.BIT.PLIDIV))
                *pll_multiplier);
    }

    /* Retrieve the programmed divisor for the clock being queried */
    switch (clock)
    {
        case LPC_ICLK :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.ICK);
            break;
        case LPC_FCLK :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.FCK);
            break;
        case LPC_PCLKA :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.PCKA);
            break;
        case LPC_PCLKB :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.PCKB);
            break;
        case LPC_PCLKC :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.PCKC);
            break;
        case LPC_PCLKD :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.PCKD);
            break;
        default :
            divisor = (uint32_t) (1 << SYSTEM.SCKCR.BIT.ICK);    /* Forced select ICLK when invalid arg */
            break;
    }

    return (uint32_t) ((float) clock_frequency[SYSTEM.SCKCR3.BIT.CKSEL] / (float) divisor);
}
/*********************************************************************************************************************
 End of function lpc_clockhzget
 ********************************************************************************************************************/

/*********************************************************************************************************************
 * Function Name: lpc_lowpower_activate_check
 * Description  : This function will check if low power activate can be executed.
 * Arguments    : void 
 *
 * Return Value : LPC_SUCCESS - 
 *                LPC_ERR_OSC_STOP_ENABLED -
 *                    The Software Standby Mode cannot be activated if oscillation stop detection is enabled.
 *                LPC_ERR_ILL_CLOCK_SOURCE -
 *                    The Sleep Mode Return Clock Switch is only supported if the clock source at the time of
 *                    entry to sleep mode is the SubClock.
 *                    If the return mode is Medium Speed Mode, then HOCO cannot be used as the return clock.
 *                LPC_ERR_ILL_MAIN_CLK_FREQ -
 *                    If the return mode is Medium Speed Mode and Main Osc is the return clock, then 
 *                    the system clock frequency limit over.
 *                LPC_ERR_DEEP_SLEEP_STATUS
 *                    The condition to go to a deep sleep mode isn't met.
 *                LPC_ERR_ILLEGAL
 *                    Other than those above.
 ********************************************************************************************************************/
static lpc_err_t lpc_lowpower_activate_check (void)
{
    uint8_t rstckcr_rstcksel;

    if (0x1 == SYSTEM.SBYCR.BIT.SSBY) /* check if entering software standby */
    {
        /* Check FENTRY0(b0) and FENTRYD(b7) */
        if (0x0000 != (FLASH.FENTRYR.WORD & 0x0081))
        {
            return LPC_ERR_ILLEGAL;         /* Cannot enter SW_Stanbay if P/E mode entry */
        }

        if (LPC_OSC_STOP_ENABLED == SYSTEM.OSTDCR.BIT.OSTDE)
        {
            return LPC_ERR_OSC_STOP_ENABLED;/* Cannot enter SW_Standby if Oscillation Stop is enabled */
        }
        if ((0 == SYSTEM.MSTPCRA.BIT.MSTPA28) 
            && ((1 == DTC.DTCST.BIT.DTCST) || (1 == DMAC.DMAST.BIT.DMST)))
        {
            return LPC_ERR_ILLEGAL;         /* Cannot enter SW_Stanbay if DTC is enabled */
        }
    }

