renesas/rx-driver-package/source/r_lpc_rx/r_lpc_rx_vx.xx/r_lpc_rx/src/targets/rx23e-b/r_lpc_rx23e-b.c
    /* Parameter check here to insure that if we are entering sleep mode with return clock switching
     * enabled then, only the Sub-clock is being used to enter sleep and if the return mode is Middle
     * Speed mode that the system clock will be less than limit
     */
    else if ((0x0 == SYSTEM.MSTPCRC.BIT.DSLPE) && /* Check if entering Sleep Mode */
             (LPC_CLOCK_SWITCH_ENABLE == SYSTEM.RSTCKCR.BIT.RSTCKEN)) /* If Return Clock Switching is enabled */
    {
        /* When entering sleep mode with return clock switching enabled, the system clock must be the sub-clock */
        if (LPC_SUB_CLOCK != SYSTEM.SCKCR3.WORD)
        {
            return LPC_ERR_ILL_CLOCK_SOURCE; /* Cannot enter Sleep if SubClock is not system clock */
        }

        if (LPC_MEDIUM_SPD == SYSTEM.OPCCR.BIT.OPCM) /* if return mode is medium speed mode */
        {
            rstckcr_rstcksel = (SYSTEM.RSTCKCR.BYTE & 0x07);

            switch (rstckcr_rstcksel)
            {
                case LPC_HOCO:

                    /* Exiting from sleep-mode to medium-speed mode with the HOCO selected is not permitted */
                    return LPC_ERR_ILL_CLOCK_SOURCE;
                    break;
                case LPC_MAIN_OSC:

                    /* When exiting sleep-mode to medium-speed mode with the main clock oscillator or LOCO selected,
                     * the system clock frequency does not exceed the limit */
                    if (((((((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.ICK) > LPC_MAX_ICK_MID_SPEED_FREQ_HZ)
                        || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.FCK) > LPC_MAX_FCK_MID_SPEED_FREQ_HZ))
                        || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKA) > LPC_MAX_PCKA_MID_SPEED_FREQ_HZ))
                        || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKB) > LPC_MAX_PCKB_MID_SPEED_FREQ_HZ))
                        || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKC) > LPC_MAX_PCKC_MID_SPEED_FREQ_HZ))
                        || ((BSP_CFG_XTAL_HZ >> SYSTEM.SCKCR.BIT.PCKD) > LPC_MAX_PCKD_MID_SPEED_FREQ_HZ))
                    {
                        return LPC_ERR_ILL_MAIN_CLK_FREQ;
                    }
                    break;
                default:

                    /* nothing here */
                    break;

            }

        }
        else
        {
            /* nothing here */
        }
    }
    else if (0x1 == SYSTEM.MSTPCRC.BIT.DSLPE)
    {
        /* Check FENTRY0(b0) and FENTRYD(b7) */
        if (0x0000 != (FLASH.FENTRYR.WORD & 0x0081))
        {
            return LPC_ERR_ILLEGAL;             /* Cannot enter Deep Sleep if P/E mode entry */
        }
        
        if (0 == SYSTEM.MSTPCRA.BIT.MSTPA28)
        {
            return LPC_ERR_DEEP_SLEEP_STATUS;   /* Cannot enter Deep Sleep if DTC is enabled */
        }
    }
    else
    {
        /* nothing here */
    }

    return LPC_SUCCESS;
}
/*********************************************************************************************************************
 End of function lpc_lowpower_activate_check
 ********************************************************************************************************************/

#endif /* LPC_CFG_PARAM_CHECKING_ENABLE == 1 */


#endif /* definedBSP_MCU_RX23E_B */


/***********************************************************************************************************************
 * End of File
 ***********************************************************************************************************************/
